app/Controllers/AsistenControllerr.php

    public function index()
    {
        $model = new Asistenmodell();
        $data['asisten'] = $model->findAll();
---
SELECT *
FROM `asisten`