app/Models/Asistenmodell.php

INSERT INTO `asisten` (`nim`, `nama`, `praktikum`, `ipk`) VALUES ('113', 'jelo', 'imk', '2,00')
---
 public function simpan($record)
{
   $this->save([
       'nim' => $record['nim'],
       'nama' => $record['nama'],
        'praktikum' => $record['praktikum'],
        'ipk' => $record['ipk'],
]);

DELETE FROM `asisten`
WHERE `nim` = '113'
---
public function hapus($nim)
    {
        $this->where(['nim' => $nim])->delete();

UPDATE `asisten` SET `nim` = '215314008', `nama` = 'MAXIMUS SIMON WERANG', `praktikum` = 'Struktur Data Linear', `ipk` = '3.25'
WHERE `asisten`.`nim` IN ('215314008')
---
    public function ubah($data)
    {
        $this->save([
            'nim' => $data['nim'],
            'nama' => $data['nama'],
            'praktikum' => $data['praktikum'],
            'ipk' => $data['ipk'],
        ]);